#ติดตั้งลองใช้งาน python ด้วย VScode
#หัวข้อหัด 8 #Operators input

a = float(input())

a = -a           # เปลี่ยนจำนวนลบเป็นบวก จํานวนบวกเป็นลบ

b = int(a)             # ปัดเศษของ a ทิ้ง

c = int(a + 0.5)       # ปัดเศษของ a แบบมีขึ้นหรือลง                                                                                                          

d = a - int(a)         # ค่าหลังจุดทศนิยมของ a

d = a % 1              # ค่าหลังจุดทศนิยมของ a                                                                                                  

e = b % 10             # เลขหลักหน่วยของ b                                                                                                       

f = b // 10 % 10       # เลขหลักสิบของ b                                                                                                         

g = b // 10**4 % 10    # เลขหลักหมื่นของ b                                                                                                          

h = input()            # h เก็บสตริง                                                                                                         

h = int(h)             # h เก็บจํานวนเต็ม (ใช้ตัวแปรซ้ำได้)                                                                                                        
